let title1 = "Шкала депресии Бека";
let title2 = "Шкала самооценки депрессии Монтгомери-Аскберга";
let title3 = "Шкала самооценки общего здоровья (GHQ)";
let title4 = "Шкала тревоги Бека";
let title5 = "Шкала тревожности и депрессии Хопкинса";
let title6 = "МР для родителей ребенка с РАС";
let title7 = "МР по доказательной практике";
let title8 = "МР по образовательной среде";
let title9 = "МР формирование здоровой обстановки";
let title10 = 'ПМПК исследование'
let title11 = 'Практическое пособие Психологическая поддержка'

const specificDate = new Date(2024, 5, 30);

module.exports = {
    async up(queryInterface, Sequelize) {
        return queryInterface.bulkInsert('resources', [
            {
                title: "Шкала депресии Бека",
                slug: title1.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Шкала депрессии Бека – это психометрический тест, который используется для измерения
                степени депрессии у взрослых и подростков. Тест состоит из 21 вопроса, каждый из которых
                оценивается по 4-балльной шкале от 0 до 3, где более высокий балл указывает на более
                серьёзные симптомы депрессии. Вопросы охватывают различные аспекты депрессии, включая
                пессимизм, чувство провала, недостаток удовольствия, потерю аппетита и проблемы со сном.
                Итоговый балл позволяет оценить глубину депрессивного состояния, причём высокие значения
                свидетельствуют о возможном тяжёлом депрессивном расстройстве. Шкала широко используется
                в клинической практике и исследованиях для диагностики и мониторинга депрессии.
                Эффективность и надёжность шкалы Бека подтверждена многочисленными исследованиями в
                разных странах и культурных контекстах.
                Бек депрессия шкаласы - ересектер мен жасөспірімдердегі депрессия дәрежесін өлшеу үшін
                қолданылатын психометриялық тест. Тест 21 сұрақтан тұрады, олардың әрқайсысы 0-ден 3-ке
                дейінгі 4 балдық шкала бойынша бағаланады, мұнда жоғары балл депрессияның ауыр белгілерін
                көрсетеді. Сұрақтар депрессияның әртүрлі аспектілерін қамтиды, соның ішінде пессимизм,
                сәтсіздік сезімі, ләззаттың болмауы, тәбеттің төмендеуі және ұйқының бұзылуы. Қорытынды балл
                депрессиялық күйдің тереңдігін бағалауға мүмкіндік береді, ал жоғары көрсеткіштер мүмкін
                болатын ауыр депрессиялық бұзылуды анықтайды. Шкала депрессияны диагностикалау және
                бақылау үшін клиникалық тәжірибеде және зерттеулерде кеңінен қолданылады. Бек шкаласының
                тиімділігі әртүрлі елдер мен мәдени контексттердегі көптеген зерттеулермен расталады.`,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 7,
                url: 'https://psytests.org/depr/bdi-run.html',
                url_description: 'Ссылка на проведение опросника'
            },
            {
                title: "Шкала самооценки депрессии Монтгомери-Аскберга",
                slug: title2.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Шкала самооценки депрессии Монтгомери-Аскберга (MADRS) – это психиатрический инструмент,
                используемый для количественной оценки степени депрессии у пациентов. Она была разработана
                в 1878 году Стюартом Монтгомери и Мари Аскберг. Шкала включает в себя 10 пунктов, каждый из
                которых оценивается по 6-балльной шкале, где более высокие баллы указывают на более
                тяжелую депрессию. Основные аспекты, которые оцениваются через MADRS, включают
                настроение, тревогу, снижение аппетита, нарушения сна и мысли о самоубийстве. Этот
                инструмент часто используется в клинических испытаниях и исследованиях, а также в клинической
                практике для оценки эффективности лечения. MADRS является чувствительным способом
                измерения изменений в течении депрессии, что делает его важным инструментом в области
                психиатрии.\n
                \n
                Монтгомери-Аскбергтің депрессияны бағалау шкаласы (MADRS) - пациенттердің депрессия
                дәрежесін анықтау үшін қолданылатын психиатриялық құрал. Оны 1878 жылы Стюарт
                Монтгомери мен Мари Аскберг жасаған. Шкала 10 пункттен тұрады, олардың әрқайсысы 6 балдық
                шкала бойынша бағаланады, мұндағы жоғары көрсеткіш ауыр депрессияны көрсетеді. MADRS
                арқылы бағаланатын негізгі аспектілерге көңіл-күй, мазасыздық, тәбеттің төмендеуі, ұйқының
                бұзылуы және суицид туралы ойлар жатады. Бұл құрал көбінесе клиникалық зерттеулерде,
                сондай-ақ емдеудің тиімділігін бағалау үшін клиникалық тәжірибеде қолданылады. MADRS
                депрессия кезіндегі өзгерістерді өлшеудің сезімтал әдісі болып табылады, бұл оны психиатрия
                саласындағы маңызды құралға айналдырады.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 7,
                url: 'https://psytests.org/depr/madrs.html',
                url_description: 'Ссылка на проведение опросника'
            },
            {
                title: "Шкала самооценки общего здоровья (GHQ)",
                slug: title3.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Шкала самооценки общего здоровья (GHQ) – это психологический тест, предназначенный для
                выявления текущих психических расстройств у людей в общих населенных группах. Основная цель
                GHQ – определить, испытывает ли человек значительные отклонения от своего нормального
                функционального уровня. Шкала включает в себя серию вопросов, которые помогают оценить
                уровень тревожности, депрессии, социальной дисфункции и потери уверенности в себе. GHQ
                существует в нескольких версиях, включая формы на 12, 28, 30 и 60 вопросов. Тест прост в
                применении и интерпретации, что делает его популярным инструментом в клинических
                исследованиях и практике. GHQ является эффективным средством для скрининга психического
                здоровья и часто используется в различных медицинских и социальных исследованиях.\n
                \n
                Жалпы денсаулықты бағалау шкаласы (GHQ) - бұл жалпы халықтық топтардағы адамдарда қазіргі
                психикалық бұзылуларды анықтауға арналған психологиялық тест. Оның негізгі мақсаты -
                адамның қалыпты функционалдық деңгейінен айтарлықтай ауытқулар бар-жоғын анықтау. Шкала
                мазасыздық, депрессия, әлеуметтік дисфункция және өзіне деген сенімділікті жоғалтуды
                бағалауға көмектесетін бірқатар сұрақтарды қамтиды. Оның бірнеше нұсқасы бар, 12, 28, 30 және
                60 сұрақты қамтитын формалардан тұрады. Тестті қолдану және түсіндіру оңай, бұл оны
                клиникалық зерттеулер мен тәжірибеде танымал құралға айналдырады. GHQ психикалық
                денсаулықты тексерудің тиімді құралы болып табылады және түрлі медициналық және әлеуметтік
                зерттеулерде жиі қолданылады.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 7,
                url: 'https://psytests.org/diag/ghq12a.html',
                url_description: 'Ссылка на проведение опросника'
            },
            {
                title: "Шкала тревоги Бека",
                slug: title4.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Шкала тревоги Бека (BAI) – это самостоятельный опросник, разработанный для измерения степени
                тревожности у взрослых и подростков. Опросник состоит из 21 вопроса, каждый из которых
                оценивается по четырёхбалльной шкале, варьирующейся от «совсем не беспокоит» до «очень
                сильно беспокоит». Шкала охватывает соматические, аффективные и когнитивные аспекты
                тревоги, позволяя определить как физические, так и психологические проявления состояния.
                Инструмент широко используется в клинической практике и исследованиях для диагностики
                тревоги, а также для оценки её тяжести и мониторинга изменений во времени. Преимуществом
                BAI является её способность дифференцировать тревогу от депрессии, что важно для точности
                диагностики и выбора лечения. Валидация и нормализация шкалы проведены в разных странах,
                подтверждая её надёжность и применимость в различных сферах.\n
                \n
                Бек мазасыздық шкаласы (BAI) – ересектер мен жасөспірімдердегі мазасыздық дәрежесін
                өлшеуге арналған сауалнама. Сауалнама 21 сұрақтан тұрады, олардың әрқайсысы «мүлдем
                мазаламайды»-дан «өте қатты мазалайды»-ға дейін түрленетін 4 балдық шкала бойынша
                бағаланады.Шкала мазасыздықтың соматикалық, аффективті және когнитивті аспектілерін
                қамтиды, бұл жағдайдың физикалық және психологиялық көріністерін анықтауға мүмкіндік
                береді. Бұл құрал клиникалық тәжірибеде және зерттеулерде мазасыздықты диагностикалау және
                оның ауырлығын бағалау, уақыттың өзгеруін бақылау үшін кеңінен қолданылады. BAI-дің
                артықшылығы - мазасыздықты депрессиядан ажырату қабілеті, бұл диагноздың дәлдігі мен
                емдеуін таңдау үшін маңызды. Шкаланың валидациясы әр түрлі елдерде жүргізіліп, оның
                сенімділігі мен түрлі салаларда қолданылуын растайды.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 7,
                url: 'https://psytests.org/diag/ghq12a.html',
                url_description: 'Ссылка на проведение опросника'
            },
            {
                title: "Шкала тревожности и депрессии Хопкинса",
                slug: title5.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Шкала тревожности и депрессии Хопкинса (HADS) – это инструмент для оценки наличия и степени
                тревожных и депрессивных симптомов. Она была разработана в 1880-х годах и широко
                используется в медицинской практике и исследованиях. Шкала содержит 14 пунктов, из которых 7
                относятся к тревожности и 7 – к депрессии. Ответы на вопросы оцениваются по четырехбалльной
                шкале, что позволяет определить степень выраженности симптомов. HADS полезна для
                идентификации психологических проблем у пациентов в общемедицинских учреждениях. Этот
                инструмент помогает врачам и психологам принимать решения о необходимости дальнейшего
                лечения или направления к специалистам.\n
                \n
                Хопкинстің мазасыздық және депрессия шкаласы (HADS) – бұл мазасыздық пен депрессиялық
                белгілердің болуы мен дәрежесін бағалау құралы. Ол 1880 жылдары жасалған және
                медициналық практика мен зерттеулерде кеңінен қолданылады. Шкалада 14 тармақ бар, оның 7–
                і мазасыздық пен 7-і депрессияға қатысты. Сұрақтардың жауаптары төрт балдық шкала бойынша
                бағаланады, бұл симптомдардың ауырлығын анықтауға мүмкіндік береді. HADS жалпы медицина
                мекемелеріндегі пациенттердегі психологиялық проблемаларды анықтау үшін пайдалы. Бұл құрал
                дәрігерлер мен психологтарға әрі қарай емдеу немесе мамандарға жолдама алу қажеттілігі
                туралы шешім қабылдауға көмектеседі.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 7,
                url: 'https://psytests.org/depr/hads-run.html',
                url_description: 'Ссылка на проведение опросника'
            },
            {
                title: "МР для родителей ребенка с РАС",
                slug: title6.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                ДЛЯ РОДИТЕЛЕЙ И ОПЕКУНОВ ДЕТЕЙ С РАССТРОЙСТВАМИ АУТИСТИЧЕСКОГО СПЕКТРА\n
                \n
                Данное руководство предоставляет основы и стратегии для понимания и поддержки детей с РАС,
                выделяя важность адаптации к уникальным потребностям каждого ребенка, основанные на
                исследованиях и опыте специалистов.
                Расстройства аутистического спектра (РАС) представляют собой нейроразвивающиеся
                расстройства, проявляющиеся через нарушения социальной взаимосвязи, коммуникации и
                поведенческие паттерны, с возможным увеличением распространенности из-за изменений в
                диагностике и осведомленности.
                У детей с РАС сенсорные системы играют важную роль и могут быть аномальными, требуя
                индивидуализированного подхода для комфортной адаптации и развития, а для коррекции
                поведения важно понимать различные типы аутостимуляции и создавать подходящую сенсорную
                среду.
                Для успешной поддержки детей с РАС важно учитывать эмоциональные аспекты, применяя
                позитивное мышление, практикуя благодарность и выбирая цифровые ресурсы осознанно, чтобы
                обеспечить их эффективное обучение и развитие.\n
                \n
                АУТИЗМ СПЕКТРІ БҰЗЫЛҒАН БАЛАЛАРДЫҢ АТА-АНАЛАРЫ МЕН ҚАМҚОРШЫЛАРЫ ҮШІН\n
                \n
                Бұл нұсқаулық мамандардың зерттеулері мен тәжірибесіне негізделген әр баланың ерекше
                қажеттіліктеріне бейімделудің маңыздылығын көрсете отырып, АСБ бар балаларды түсіну және
                қолдау үшін негіздер мен стратегияларды ұсынады.
                Аутизм спектрінің бұзылуы (АСБ) диагностика мен хабардарлықтың өзгеруіне байланысты
                таралуының ықтимал жоғарылауымен әлеуметтік қарым-қатынастың, коммункацияның және
                мінез-құлық үлгілерінің бұзылуы арқылы көрінетін нейродаму бұзылыстары болып табылады.
                АСБ бар балаларда сенсорлық жүйелер маңызды рөл атқарады және ауытқымалы болуы мүмкін,
                ыңғайлы бейімделу мен даму үшін жекелендірілген тәсілді қажет етеді және мінез-құлықты түзету
                үшін аутостимуляцияның әртүрлі түрлерін түсіну және қолайлы сенсорлық ортаны құру маңызды.
                АСБ бар балаларға сәтті қолдау көрсету үшін эмоционалды аспектілерді ескеру, позитивті ойлауды
                қолдану, ризашылық білдіру және олардың тиімді оқуы мен дамуын қамтамасыз ету үшін сандық
                ресурстарды саналы түрде таңдау маңызды.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 6,
                module_id: 8,
                url: '',
                url_description: ''
            },
            {
                title: "МР по доказательной практике",
                slug: title7.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                По доказательной практике диагностики расстройств аутистического спектра у детей на уровне
                первичной медико-санитарной помощи\n
                \n
                В последние годы наблюдается рост расстройств аутистического спектра (РАС) во всем мире, а
                понимание их природы и последних достижений в этой области помогает проводить раннюю
                диагностику и оказывать поддержку родителям и опекунам детей с РАС. Методические
                рекомендации предназначены для медицинских специалистов и других заинтересованных лиц,
                охватывая вопросы диагностики, классификации и поддержки детей с РАС на уровне первичной
                медико-санитарной помощи.\n
                \n
                Оценка расстройства аутистического спектра включает анализ клинических особенностей и
                использование соответствующих инструментов, таких как анкеты по развитию и шкалы общения, а
                также требует многопрофильной команды специалистов. Рекомендуется проводить скрининг РАС
                всем детям в возрасте 18 и 24 месяца с использованием различных методов, включая мониторинг
                развития и осмотры ребенка.\n
                \n
                При диагностике РАС основное внимание уделяется клиническому методу, включая наблюдение
                за поведением и сбор анамнеза, который охватывает медицинскую и семейную историю, раннее
                развитие и социальную адаптацию пациента. Диагноз РАС устанавливается наличием ключевых
                особенностей, таких как нарушение социального взаимодействия и повторяющееся поведение,
                подчеркивая гетерогенность этого расстройства.\n
                \n
                При описании психического статуса пациента учитывается его поведение, уровень развития речи и
                моторики, мыслительные способности, знания, социальное поведение, а также память, интеллект
                и эмоциональная сфера, с учетом соответствия его развития сверстникам того же пола и
                когнитивным способностям.\n
                \n
                Алғашқы медициналық-санитарлық көмек деңгейінде балалардағы аутизм спектрінің бұзылуын
                диагностикалаудың дәлелді практикасы бойынша\n
                \n
                Соңғы жылдары бүкіл әлемде аутизм спектрінің бұзылуының (АСБ) өсуі байқалды және олардың
                табиғаты мен осы саладағы соңғы жетістіктерін түсіну ерте диагноз қоюға және АСБ бар
                балалардың ата-аналары мен қамқоршыларына қолдау көрсетуге көмектеседі. Әдістемелік
                ұсынымдар медицина мамандары мен басқа да мүдделі тұлғаларға арналған, бастапқы медициналық-санитарлық көмек деңгейінде АСБ бар балаларды диагностикалау, жіктеу және
                қолдау мәселелерін қамтиды.\n
                \n
                Аутизм спектрінің бұзылуын бағалау клиникалық ерекшеліктерді талдауды және даму
                сауалнамалары мен байланыс шкалалары сияқты тиісті құралдарды пайдалануды қамтиды және
                көп салалы мамандар тобын қажет етеді. 18 және 24 айлық барлық балаларға әр түрлі әдістерлі
                қолда отырып AСБ скринингін өткізуді соның ішінде баланың дамуын бақылау мен тексеруді
                қолдану ұсынылады.\n
                \n
                AСБ диагностикасы клиникалық әдіске, соның ішінде мінез-құлықты бақылауға және
                медициналық және отбасылық тарихты, ерте дамуды және пациенттің әлеуметтік бейімделуін
                қамтитын тарихты жинауға бағытталған. AСБ диагнозы әлеуметтік өзара әрекеттесудің бұзылуы
                және қайталанатын мінез-құлық сияқты негізгі белгілердің болуымен анықталады, бұл
                бұзылыстың гетерогенділігін көрсетеді.\n
                \n
                Науқастың психикалық жағдайын сипаттау оның мінез-құлқын, сөйлеу мен моториканың даму
                деңгейін, ойлау қабілетін, білімін, әлеуметтік мінез-құлқын, сондай-ақ есте сақтау қабілетін,
                интеллектісі мен эмоционалдық саласын, оның дамуының бір жыныстағы құрдастарының сәйкес
                келуі және танымдық қабілеттеріне қарап ескеріледі.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 6,
                module_id: 8,
                url: '',
                url_description: ''
            },
            {
                title: "МР по образовательной среде",
                slug: title8.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Методические рекомендации по организации инклюзивной образовательной среды для детей с
                ООП в общеобразовательной школе\n
                \n
                В Казахстане обучение детей с особыми образовательными потребностями направлено на их
                успешную социализацию и профессиональную реализацию через социальную реабилитацию и
                адаптацию. Законодательство гарантирует бесплатное образование на всех уровнях, включая
                дополнительные средства для детей с ограниченными возможностями, и прописывает принципы
                инклюзивного образования. Инклюзивная политика способствует равному доступу к обучению и
                созданию условий для успешного образования каждого ребенка.\n
                \n
                Руководство инклюзивной школы должно создавать среду, способствующую включению всех
                детей и обеспечивающую равный доступ к образованию. Педагоги должны тесно сотрудничать с
                родителями и специалистами, а поддержка в классе может включать адаптацию программ и
                консультации. Психолого-педагогическое сопровождение включает оценку потребностей детей и
                создание условий для успешного обучения и социализации.\n
                \n
                Создание поддерживающей обучающей среды для детей с эмоциональными и поведенческими
                нарушениями включает учет их потребностей и установление доверительных отношений с
                учителем. Интеграция детей с аутизмом требует создания поддерживающей среды и
                эффективных методов общения. Технологии социально-педагогического сопровождения детей с
                трудностями в образовании включают диагностику и целеполагание для обеспечения равных
                возможностей для всех учащихся.\n
                \n
                Жалпы білім беретін мектепте ЕБАҚ бар балаларға арналған инклюзивті білім беру ортасын
                ұйымдастыру бойынша әдістемелік ұсынымдар\n
                \n
                Қазақстанда ерекше білім беру қажеттіліктері бар балаларды оқыту оларды оңалту мен бейімдеу
                арқылы нәтижелі әлеуметтендіруге бағытталған. Заңнама мүмкіндігі шектеулі балаларға арналған
                қосымша қаражатты қоса алғанда, барлық деңгейлерде тегін білім алуға кепілдік береді және
                инклюзивті білім беру принциптерін белгілейді. Инклюзивті саясат оқытуға тең қол жеткізуге және
                әр баланың нәтижелі білім алуы үшін жағдай жасауға ықпал етеді.\n
                \n
                Инклюзивті мектеп басшылығы барлық балалардың қосылуына ықпал ететін және білімге тең қол
                жетімділікті қамтамасыз ететін орта құруы керек. Тәрбиешілерге ата-аналармен және
                мамандармен тығыз жұмыс істеу қажет, ал сыныптағы қолдау бағдарламаларды бейімдеу мен
                кеңес беруді қамтуы мүмкін. Психологиялық-педагогикалық қолдау балалардың қажеттіліктерін
                бағалауды және нәтижелі оқу мен әлеуметтену үшін жағдай жасауды қамтиды.\n
                \n
                Эмоционалды және мінез-құлық бұзылыстары бар балаларға қолдау көрсететін оқу ортасын құру
                олардың қажеттіліктерін ескеруді және мұғаліммен сенімді қарым-қатынас орнатуды қамтиды.
                Аутизмі бар балаларды интеграциялау қолдау ортасын және тиімді қарым-қатынас әдістерін
                құруды талап етеді. Білім берудегі қиындықтары бар балаларды әлеуметтік-педагогикалық қолдау
                технологиялары барлық оқушылар үшін тең мүмкіндіктерді қамтамасыз ету үшін диагностика мен
                мақсат қоюды қамтиды.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 6,
                module_id: 8,
                url: '',
                url_description: ''
            },
            {
                title: "МР формирование здоровой обстановки",
                slug: title9.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                ФОРМИРОВАНИЕ ЗДОРОВОЙ ОБСТАНОВКИ С ДЕТЬМИ С РАССТРОЙСТВАМИ АУТИСТИЧЕСКОГО
                СПЕКТРА\n
                \n
                Данная методическая рекомендация предназначена для педагогов и других специалистов,
                работающих в школах, с целью интеграции детей с расстройством аутистического спектра (РАС) в
                учебный процесс.\n
                \n
                Расстройства аутистического спектра представляют собой пожизненные расстройства
                психического развития, с выраженным дефицитом в социальном общении и повторяющимся
                поведением. Глобально РАС встречается у 98 на 10 000 человек, возможно, увеличение числа
                случаев связано с изменениями в диагностике и повышенной осведомленности, при этом у
                мужчин они выявляются чаще, возможно, из-за воздействия генетических и окружающих
                факторов.\n
                \n
                Важно создавать в школе поддерживающие условия для детей с РАС, включая
                индивидуализированные планы поддержки, тренинги по социальным навыкам и предотвращать
                случаи буллинга. Психологическая поддержка и консультирование также необходимы для
                помощи детям с РАС в справлении с тревожностью и депрессией.\n
                \n
                Эти меры помогают детям с РАС развивать социальные навыки и успешно адаптироваться в
                учебной обстановке.\n
                \n
                АУТИЗМ СПЕКТРІ БҰЗЫЛҒАН БАЛАЛАРҒА САЛАУАТТЫ ОРТА ҚАЛЫПТАСТЫРУ\n
                \n
                Бұл әдістемелік ұсыныс мектептерде аутизм спектрі бұзылған балаларды (АСБ) оқу процесіне
                біріктіру мақсатында жұмыс істейтін педагогтар мен басқа мамандарға арналған.\n
                \n
                Аутизм спектрінің бұзылуы - бұл өмір бойы психикалық дамудың бұзылуы, әлеуметтік қарым-
                қатынастың айқын жетіспеушілігі және қайталанатын мінез-құлық. Жаһандық көрсеткіш бойынша
                АСБ 10 000-адамның 98-де кездеседі, жағдайлардың көбеюі диагностиканың өзгеруіне және
                хабардарлықтың жоғарылауына байланысты болуы мүмкін, генетикалық және қоршаған орта
                факторларының әсерінен ер адамдарда жиі анықталады.\n
                \n
                Мектепте АСБ бар балаларға қолдау көрсету жағдайларын, соның ішінде жеке қолдау
                жоспарларын, әлеуметтік дағдылар бойынша тренингтер құру және буллинг жағдайларының
                алдын алу маңызды. АСБ бар балаларға мазасыздық және депрессиямен күресуге көмектесу үшін
                психологиялық қолдау мен кеңес беру қажет.\n
                \n
                Бұл шаралар АСБ бар балаларға әлеуметтік дағдыларды дамытуға және оқу жағдайында сәтті
                бейімделуге көмектеседі.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 6,
                module_id: 8,
                url: '',
                url_description: ''
            },
            {
                title: "ПМПК исследование:",
                slug: title10.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                ПМПК исследование:\n
                \n
                В Казахстане было проведено исследование о роли и методах работы психолого-медико-
                педагогических консультаций (ПМПК) с детьми, страдающими расстройствами аутического
                спектра (РАС), в рамках целей устойчивого развития ООН.\n
                \n
                Для этого была использована анкета с 16 вопросами, опрос приняли 346 респондентов из 8
                регионов Казахстана с помощью Google Forms, а данные анализировались с использованием SPSS,
                что позволило выявить 6 ключевых категорий в работе с детьми с РАС.\n
                \n
                Результаты показали, что большинство участников опроса отмечают рост детей с РАС и выявили
                нехватку знаний и навыков у специалистов ПМПК, осуществляющих диагностику и оценку детей с
                РАС.\n
                \n
                Проведение дополнительного обучения и подготовка персонала ПМПК являются важными
                шагами для улучшения качества обслуживания детей с РАС и развития инклюзивной
                образовательной среды.\n
                \n
                ПМПК зерттеу:\n
                \n
                Қазақстанда БҰҰ-ның тұрақты даму мақсаттары шеңберінде аутизм спектрінің бұзылуы (АСБ) бар
                балалармен психологиялық-медициналық-педагогикалық консультациялардың (ПМПК) рөлі мен
                жұмыс әдістері туралы зерттеу жүргізілді.\n
                \n
                Ол үшін 16 сұрақтан тұратын сауалнама пайдаланылды, сауалнаманы Google Forms көмегімен
                Қазақстанның 8 өңірінен 346 респондент қабылдады, ал деректер SPSS көмегімен талданды, бұл
                АСБ бар балалармен жұмыс істеуде 6 негізгі санатты анықтауға мүмкіндік берді.\n
                \n
                Сауалнама қатысушыларының көпшілігі АСБ бар балалар санының өсуін және АСБ бар балаларды
                диагностикалау мен бағалауды жүзеге асыратын ПМПК мамандарының білімі мен дағдыларының
                жетіспеушілігін анықтағанын көрсетті.\n
                \n
                ПМПК қызметкерлерін қосымша оқыту және даярлау АСБ бар балаларға қызмет көрсету сапасын
                жақсарту және инклюзивті білім беру ортасын дамыту үшін маңызды қадамдар болып табылады.
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 6,
                module_id: 9,
                url: '',
                url_description: ''
            },
            {
                title: "Асыл Мирас",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - asylmiras.kz
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/asylmiras.kz?igsh=MW0wY2U4MWZnemlrcg==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПМПК №1 города Астана",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pmpk1_astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pmpk1_astana?igsh=dmJzcmN1MGs0azUw',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПМПК №2 города Астана",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pmpk2_astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pmpk2_astana?igsh=Y3Ntdmd5ems3cTI5',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПМПК №4 города Астана",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pmpk_4astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pmpk_4astana?igsh=bGx4bTJnazVoNTV0',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПМПК №5 города Астана",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pmpk5_nursultan
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pmpk5_nursultan?igsh=Z3NnOTJtMDJ2aWsw',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПМПК №8 города Астана",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pmpk8_astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pmpk8_astana?igsh=cmppZ2MzdGo2cTNz',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ОО ОРДА",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - orda_autism
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/orda_autism?igsh=N3JtbXVieTBxOWlu',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Благотворительный фонд 'Дара'",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - dara.charity
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/dara.charity?igsh=bzh0eDI5ZTgwdGN4',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПРОАБА",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - proaba
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/proaba?igsh=Z2NrdnFla3gxNXA2',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Коррекционный центр Орлеу",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - orleu.center.astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/orleu.center.astana?igsh=NDJyZThuNWI3Nzhn',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Реабилитационный центр Шипагер",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - shipager.reabilitaciya
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/shipager.reabilitaciya?igsh=MWFrOWJhdWtoaXhqYQ==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Реабилитационный центр Умит",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - rc_umit
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/rc_umit?igsh=MWZpM2thN3h4cXR1eQ==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "DOS",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - dos.community
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/dos.community?igsh=enkzbnEwc2Rmb2Ez',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Фонд помощи детям с аутизмом и другими особенностями развития Луч Света",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - luchsveta96
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/luchsveta96?igsh=MTVsNGhwM2k3OW55eg==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ОФ 'Дети Рисуют Мир'",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - drmfund.kz
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/drmfund.kz?igsh=MTEwa2w5dzB1Y2Nt',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ПЛЦ LOGOS",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - logos_center_astana_logos_center
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/logos_center_astana_?igsh=aWNnMWZ4MWh1ZTI4',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Союз родителей особенных детей",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - srodkz
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/srodkz?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КГУ <КППК N2> г. Астаны",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk2_astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk2_astana?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №1",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk1_astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk1_astana?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КГУ 'КППК 4' г. Астана",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk4_astana
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk4_astana?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК 8 г. АТБАСАР қаласы",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_8_atbasar
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_8_atbasar?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №20 г.Косшы",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_20_k
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_20_k?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw===',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Костанай",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_kostanay
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_kostanay?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Караганда",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk3_karaganda
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk3_karaganda?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Аркалыка",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pptk_arkalyk
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pptk_arkalyk?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №6 г.Караганда",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk6_karaganda
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk6_karaganda?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №14 г. Шортанды",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_14
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_14?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Талдыкорган",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk1_taldykorgan
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk1_taldykorgan?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №2 г.Ерементау",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk2.ereymentau
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk2.ereymentau?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №18 c. Коргалжын",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppkkorgalzhyn18
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppkkorgalzhyn18?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК №1 г.Шымкент",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_shymkent_1
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_shymkent_1?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Абай",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_abay
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_abay?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Семей",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kppk_semey
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kppk_semey?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "КППК г.Усть-Каменогорска",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - ukkppk
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/ukkppk?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "№2 ППТК Ақтөбе қаласы",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - aktobe_kppk2
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/aktobe_kppk2?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Сообщество родителей и экспертов, объединенное целью помощи людям с аутизмом в Казахстане",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - rastemka.aktobe
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/rastemka.aktobe?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "«Не Как Все» — проект для людей с аутизмом",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - nekakvse_projekt
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/nekakvse_projekt?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "ОФ «ИНКЛЮЗИВНЫЕ РОДИТЕЛИ»",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - inclusive_parents
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/inclusive_parents?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Ассоциация родителей детей с аутизмом Проект «Аутизм победим!»",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.facebook.com/groups/159232250929621/',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Национальная Ассоциация AUTISM KAZAKHSTAN",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'http://ww25.ainar.org/oipyul-nacional-naya-associaciya-autism-kazakhstan?subid1=20240415-0652-39b5-b215-48403ef1df5b',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Ассоциация родителей детей инвалидов «АРДИ»",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://ardi.kz/',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Общественный фонд «КунБала»",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://kunbala.kz/',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Общественный Фонд «Центр системных исследований»",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'http://autism.kz/index.php/pages/about-us',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг города Кокшетау",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kokshetau_aleumettik_ortaligi
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kokshetau_aleumettik_ortaligi?igsh=MXJrdGZhdW1jNm9mYw== 8 (7162) 25 61 81',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг №2 города Караганды	",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: '8 (7212) 37‒09‒13 - приемная, 8 (7212) 37‒10‒00 - бухгалтерия',
                url_description: 'Контакты:'
            },
            {
                title: "Центр оказания специальных социальных услуг №3 города Караганды",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - pmsu_2krg
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/pmsu_2krg?igsh=MWNtYzhybWFuN2RlcA==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг №1 города Караганды",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kgu_1karaganda
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kgu_1karaganda?igsh=emgwZGI2Nm9wNnE3',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг Карагандинской области 'Активное долголетие'",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/aktivnoedolgoletie_krg.obl?igsh=c2M5ZnFtc2d6MGpo',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг №1 Абай",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - soc_center_abay
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/soc_center_abay?igsh=MWRiazBoZHE0OHJmaw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг города Макинск",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Страница в инстаграме - kmm_makinsk
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kmm_makinsk?igsh=MWIyYnA2bXdxbWozMw==',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Центр оказания специальных социальных услуг №3 города Актау",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: '8 (7292) 50‒13‒15 - приемная, 8 (7292) 50‒12‒29',
                url_description: 'Контакты:'
            },
            {
                title: "Центр оказания специальных социальных услуг №1 города Шымкент",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: '8 (7252) 53‒10‒54 - приемная, 8 (7252) 53‒10‒48 - отдел бухгалтерии',
                url_description: 'Контакты:'
            },
            {
                title: "Костанайский центр оказания специальных социальных услуг",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: '8 (7142) 26‒14‒91 - приемная',
                url_description: 'Контакты:'
            },
            {
                title: "Центр оказания специальных социальных услуг №4 Атырау",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: '8 (7122) 32‒58‒05, 8 (7122) 35‒54‒82, 8 (7122) 32‒48‒91',
                url_description: 'Контакты:'
            },
            {
                title: "Трудоустройство",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Особенные родители
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/osobennie.roditely_/?locale=ru&hl=am-et',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Трудоустройство",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Жанна Калиева ПОВЕДЕНЧЕСКИЙ АНАЛИТИК
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/zhanna.kalieva.aba/',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Трудоустройство",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Training-кафе г. Алматы
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/training_cafe/',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Трудоустройство",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Kunde Social Cafe
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kundecafe/',
                url_description: 'Ссылка на страницу'
            },
            {
                title: "Трудоустройство",
                slug: title11.replace(/\s+/g, '-').toLowerCase(),
                file_patch: '' || null,
                description: `
                Kunde Social Cafe
                `,
                createdAt: specificDate,
                updatedAt: specificDate, 
                type_id: 3,
                module_id: 6,
                url: 'https://www.instagram.com/kundecafe/',
                url_description: 'Ссылка на страницу'
            },
        ]);
    },

    async down(queryInterface, Sequelize) {
        return queryInterface.bulkDelete('resources', null, {});
    }
};