module.exports = {
    async up(queryInterface, Sequelize) {
        const specificDate = new Date(2024, 3, 27); // Месяц апрель (3) и день 27, год 2024

        return queryInterface.bulkInsert('news', [
            {
                title: "Мероприятие интеграции детей с расстройствами аутистического спектра",
                slug: 121,
                description: `Все больше и больше людей заинтересованы в нашем проекте! Наша команда была приглашена на обсуждение вопросов создания инклюзивного общества в высших учебных заведениях, организатором которого является Казахский национальный педагогический университет имени Абая. Присоединяйтесь к увлекательному круглому столу о теме «Инклюзия и социальная адаптация студентов»! 🌟\n
                📅 Дата: 25 апреля 2024 г.\n
                🕒 Время: 09:30-16:30\n
                📍 Место: Казахский национальный педагогический университет имени Абая, г. Алматы, проспект Достык 13, конференц-зал 202\n
                💻 Формат: офлайн/онлайн\n
                🔍 В ходе мероприятия будут обсуждаться вопросы интеграции детей с расстройствами аутистического спектра в образовательную среду. Присоединяйтесь к выступлениям руководителя проекта Ляззат Кошербаевой, Айжан Самамбаевой и Лауры Кожагельдиевой из SDU, которые поделятся основными результатами своего проекта.\n
                Присоединяйтесь к обсуждению важных тем над созданием более инклюзивной образовательной среды! Регистрация по ссылке в профиле.`,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            
            // Статьи   
            {
                title: "2023 1 тезис Барселона онлайн",
                slug: `2023_1_тезис_барселона_онлайн`,
                description: `Кожагелдиева Лаура, магистр общественного здоровья с опытом работы над различными
                проектами, финансируемыми правительством и международными организациями, выступила
                спикером на третьей международной конференции «Future of preventive medicine and public
                health», которая прошла 30-31 марта 2023 года. Ее презентация была посвящена диагностике и
                поддержке пациентов с расстройством аутистического спектра в Казахстане. В исследовании
                Кожагелдиевой были проанализированы регуляторные документы, описывающие алгоритм
                поддержки людей с РАС. Результаты и обсуждение исследования показали, что хоть и были
                сделаны некоторые улучшения в практике диагностики и поддержки пациентов с РАС, все еще
                существуют проблемы, такие как задержка в диагностике (4 года и старше) и нехватка
                специалистов. Данное исследование было поддержано Комитетом по науке Министерства науки
                и высшего образования Республики Казахстан\n
                \n
                Қожагелдиева Лаура, Үкімет пен халықаралық ұйымдар қаржыландыратын түрлі жобаларда
                жұмыс тәжірибесі бар қоғамдық денсаулық сақтау магистрі, 2023 жылдың 30-31 наурызында
                өткен «Future of preventive medicine and public health» үшінші халықаралық конференциясында
                спикер болды. Оның презентациясы Қазақстанда аутизм спектрі бұзылған науқастарды
                диагностикалау мен қолдауға арналды. Кожагелдиеваның зерттеуінде АСБ бар адамдарды қолдау
                алгоритмін сипаттайтын реттеуші құжаттар талданды. Зерттеудің нәтижелері мен талқылауы АСБ
                пациенттерін диагностикалау және қолдау тәжірибесінде кейбір жақсартулар болғанымен,
                диагностиканың кешігуі (4 жас және одан жоғары) және мамандардың жетіспеушілігі сияқты
                мәселелер әлі де бар екенін көрсетті. Бұл зерттеуді Қазақстан Республикасы Ғылым және жоғары
                білім министрлігінің Ғылым комитеті қолдады.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "2023 2 тезис Малайзия",
                slug: `2023_2_тезис_малайзия_онлайн`,
                description: `Тенденции распространения расстройств аутистического спектра среди детей в Казахстане
                Расстройство аутистического спектра (РАС) — это заболевание, диагностируемое в основном в
                возрасте до трех лет. В последние годы исследования показали рост заболеваемости во всем
                мире, и распространенность заболевания в мире составила 0,6%, в то время как в Азии - 0,4%,
                Америке и Африке - 1%, Европе - 0,5% и Австралии - 1,7%.
                За последние десять лет было проведено усиление межсекторальной работы. Деятельность
                Министерства образования укрепила направление развития инклюзивного образования, что
                способствовало выявлению детей с РАС и обеспечило индивидуальное обучение как в
                специализированных, так и в общеобразовательных школах с инклюзивными классами. С 2013 по
                2022 год число детей с РАС увеличилось в восемь раз. "Тенденции на следующие пять лет" (2027)
                показывают, что по сравнению с 2013 годом это число увеличится в 10 раз (до 238,98).
                Тенденция свидетельствует о дальнейшем росте числа выявляемых детей с РАС, поэтому важно
                подготовить больше педагогических кадров и ресурсов для оказания помощи детям с РАС и
                обеспечения надлежащего образования.\n
                \n
                Қазақстандық балалар арасында аутизм спектрінің бұзылуының таралу тенденциясы\n
                \n
                Аутизм спектрінің бұзылуы (АСБ) — бұл негізінен үш жасқа дейін анықталатын диагноз. Соңғы
                жылдары зерттеулер бүкіл әлемде аурудың өсуін көрсетті және оның таралуы әлемде 0,6%-ды
                құрады, ал Азия - 0,4%, Америка мен Африка - 1%, Еуропа - 0,5% және Австралия - 1,7%.
                Соңғы он жылда сектораралық жұмыс күшейтілді. Білім Министрлігінің қызметі инклюзивті білім
                беруді дамыту бағытын нығайтты, бұл АСБ бар балаларды анықтауға ықпал етті және инклюзивті
                сыныптары бар мамандандырылған және жалпы білім беретін мектептерде жеке оқытуды
                қамтамасыз етті. 2013 жылдан 2022 жылға дейін АСБ бар балалар саны сегіз есе өсті. «Алдағы бес
                жылдағы тенденциялар» (2027) 2013 жылмен салыстырғанда бұл сан 10 есеге (238,98-ге дейін)
                өсетінін көрсетеді.
                Тенденция АСБ бар балалар санының одан әрі өсуін көрсетеді, сондықтан AСБ бар балаларға
                көмек көрсету және тиісті білім беруді қамтамасыз ету үшін көбірек педагогикалық кадрлар мен
                ресурстарды дайындау маңызды.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "2023 3 тезис Дублин",
                slug: `2023_3_тезис_дублин_онлайн`,
                description: `Межсекторальный уход за детьми с расстройством аутичного спектра в Казахстане: мнение и
                взгляд родителей\n
                \n
                В Казахстане наблюдается устойчивый рост распространённости аутических расстройств, что
                делает важным своевременное выявление и межсекторальную помощь, включающую
                социальную, медицинскую и образовательную поддержку для социализации детей. В
                исследовании участвовали 60 родителей детей с аутизмом, где было выявлено, что 26% семей
                составляют одинокие родители, 30% живут в сельской местности, 66,6% семей имеют одного
                работающего родителя и только 58,3% имеют высшее образование. Большинство семей
                сталкиваются с недостаточной поддержкой со стороны государства, основные расходы
                приходятся на учебники и спортивные занятия, в то время как серьёзные услуги, как ПАП-терапия
                и посещение невролога, требуют значительных затрат из собственного кармана из-за долгих
                ожиданий. Родители выразили потребность в получении информации и психологической
                поддержке через семинары. А также, подчеркивается важность межсекторального
                сотрудничества для обеспечения комплексной помощи детям с аутизмом и необходимость
                улучшения доступа к транспорту, ресурсам и сокращения времени ожидания услуг специалистов.\n
                \n
                Қазақстандағы аутизм спектрі бұзылған балаларға сектораралық күтім көрсету: ата-аналар пікірі
                мен көзқарасы.\n
                \n
                Қазақстанда аутизм спектрі бұзылуының таралуы тұрақты өсіп келеді, бұл балаларды
                әлеуметтендіру үшін әлеуметтік, медициналық және білім беруді қолдауды қамтитын
                сектораралық көмекті уақтылы анықтауды қажет етеді. Зерттеуге аутизмі бар балаларды
                тәрбиелеп отырған 60 ата-ана қатысты, отбасылардың 26%-ы жалғызбасты ата-аналар, 30%-ы
                ауылдық жерлерде тұрады, отбасылардың 66,6%-ында тек бір жұмыс істейтін ата-ана болса, тек
                58,3%-ында жоғары білім бар екендігі анықталды. Көптеген отбасылар мемлекет тарапынан
                қолдаудың жеткіліксіздігіне тап болады, негізгі шығындар оқулықтар мен спорттық жаттығуларға
                жұмсалады, ал АВА терапиясы және невропатологқа бару сияқты маңызды қызметтер ұзақ күтуіне
                байланысты айтарлықтай шығындарды талап етеді. Ата-аналар семинарлар арқылы ақпарат алу
                және психологиялық қолдау қажеттілігін білдірді. Сондай-ақ, аутизмі бар балаларға кешенді
                көмек көрсету үшін сектораралық ынтымақтастықтың маңыздылығы және көлікке, ресурстарға
                қолжетімділікті жақсарту, бұдан бөлек мамандар қызметтерінің күту уақытын қысқарту қажет
                екендігі айтылды.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "ВАК 3 Семей done",
                slug: `вак_3_семей_done`,
                description: `Сопровождение ученика с расстройством аутистического спектра в школах Казахстана: роль
                помощника учителя.\n
                \n
                Исследование, проведенное в рамках проекта «Интеграция детей с расстройством аутистического
                спектра в социально-образовательную среду на основе комплексной поддержки: вызовы и
                преимущества», направлено на изучение опыта работы помощников учителей в поддержке детей
                с расстройством аутистического спектра (РАС) в средних школах страны. Результаты исследования
                позволили собрать и проанализировать данные на основе опроса и интервью с ассистентами
                учителей, выявить проблемы в обеспечении равных прав всех детей на качественное
                образование, а также в области психолого-педагогической поддержки детей с РАС в школах.
                Одной из важнейших задач для современных учебных заведений является обеспечение
                качественной инклюзивной образовательной среды, где каждый ученик имеет равные
                возможности. Для этого необходимы значительные преобразования в традиционной системе
                образования, а также подготовка учителей к работе с детьми с особыми образовательными
                потребностями, включая детей с РАС. Для обеспечения права каждого ребенка на качественное
                образование создаются службы психолого-педагогической поддержки как отдельное структурное
                подразделение комплексной школы. Основной сложностью для учителей при интеграции детей с
                поведенческими и эмоциональными трудностями, большинство из которых - дети с РАС, является
                формирование инклюзивной культуры образовательной организации и вовлечение всех детей в
                образовательную среду, учитывая их особые потребности и способности. Для решения этой
                проблемы важна системная работа по подготовке и повышению профессиональных компетенций
                помощников учителя, особенно сопровождающих детей с РАС.\n
                \n
                Қазақстан мектептерінде аутизм спектрі бұзылған оқушыға қолдау көрсету: мұғалім көмекшісінің
                рөлі.\n
                \n
                «Аутизм спектрі бұзылған балаларды кешенді қолдау негізінде әлеуметтік-білім беру ортасына
                интеграциялау: қиындықтар мен артықшылықтар» жобасы аясында жүргізілген зерттеу елдің орта
                мектептерінде аутизм спектрі бұзылған балаларды (AСБ) қолдаудағы мұғалімдер көмекшілерінің
                тәжірибесін зерттеуге бағытталған. Зерттеу нәтижелері мұғалімдердің ассистенттерімен
                жүргізілген сауалнама мен сұхбат негізінде деректерді жинауға және талдауға, барлық
                балалардың сапалы білім алуға тең құқықтарын қамтамасыз етудегі, сондай-ақ мектептерде АСБ
                бар балаларды психологиялық-педагогикалық қолдау саласындағы проблемаларды анықтауға
                мүмкіндік берді. Заманауи оқу орындары үшін маңызды міндеттердің бірі - әр оқушының
                мүмкіндіктері тең болатын сапалы инклюзивті білім беру ортасын қамтамасыз ету. Ол үшін
                дәстүрлі білім беру жүйесінде айтарлықтай өзгерістер, сондай-ақ мұғалімдерді ерекше білім беру
                қажеттіліктері бар балалармен, соның ішінде АСБ бар балалармен жұмыс істеуге дайындау қажет.
                Әр баланың сапалы білім алу құқығын қамтамасыз ету үшін кешенді мектептің психологиялық-
                педагогикалық қолдау қызметтері жеке құрылымдық бөлімше ретінде құрылады. Мінез - құлық
                және эмоционалдық қиындықтары бар балаларды, олардың көпшілігі АСБ бар балаларды
                интеграциялау кезінде мұғалімдер үшін негізгі қиындық білім беру ұйымының инклюзивті
                мәдениетін қалыптастыру және олардың ерекше қажеттіліктері мен қабілеттерін ескере отырып,
                барлық балаларды білім беру ортасына тарту болып табылады. Бұл мәселені шешу үшін АСБ бар
                балалармен жұмыс істейтін мұғалімдердің көмекшілерін даярлау және кәсіби құзыреттілігін
                арттыру бойынша жүйелі жұмыс маңызды.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "ВАК 1 Фармация done",
                slug: `вак_1_фармация_done`,
                description: `1
                РОЛЬ ИСКУССТВЕННОГО ИНТЕЛЛЕКТА ДЛЯ ЛЕЧЕНИЯ ДЕТЕЙ С РАССТРОЙСТВОМ
                АУТИСТИЧЕСКОГО СПЕКТРА: МЕЖДУНАРОДНЫЙ ОПЫТ\n
                \n
                В последние десятилетия отмечается рост исследований по применению искусственного
                интеллекта (ИИ), позволяющий проводить процесс диагностики на раннем этапе, что
                предоставляет своевременный доступ к лечению детей с РАС. Важно отметить, что системы на
                основе ИИ все еще разрабатываются и проверяются, и не все они еще широко применяются в
                клинической практике. Кроме того, модели ИИ следует использовать как дополнительный
                инструмент, а не как единственный метод диагностики, и всегда под наблюдением
                квалифицированного специалиста. Были проанализированы результаты пяти систематических
                обзоров, двух мета-анализов, трех систематических обзоров-мета-анализов. В настоящее время
                нет единых подходов применения ИИ для диагностики и лечения детей с РАС. Существующие
                алгоритмы машинного обучения подразделяется на контролируемые, полу-контролируемые,
                неконтролируемые. Большинство работ включали в себя оценку производительности машины
                опорных векторов, нейронные сети и деревья решений, из которых наибольшую эффективность
                продемонстрировал анализ нейронной сети. ИИ применяется различными способами для
                диагностики и лечения РАС. Проведенный анализ показал рост исследований в области ИИ для
                диагностики и лечения РАС, который имеет большой потенциал в будущих разработках и
                производительности.\n
                \n
                АУТИЗМ СПЕКТРІ БҰЗЫЛҒАН БАЛАЛАРДЫ ЕМДЕУДЕГІ ЖАСАНДЫ ИНТЕЛЛЕКТТІҢ РӨЛІ:
                ХАЛЫҚАРАЛЫҚ ТӘЖІРИБЕ.\n
                \n
                Соңғы онжылдықтарда диагностика процесін ерте жүргізуге мүмкіндік беретін жасанды
                интеллектті (ЖИ) қолдану бойынша зерттеулердің өсуі байқалады, бұл АСБ бар балаларды
                емдеуге уақтылы қол жеткізуге мүмкіндік береді.\n
                \n
                Айта кету керек, ЖИ негізіндегі жүйелер әлі де әзірленіп, тексерілуде және олардың барлығы
                клиникалық тәжірибеде әзірге кеңінен қолданыла бермейді. Сонымен қатар, ЖИ үлгілері
                диагностиканың жалғыз әдісі ретінде емес, қосымша құрал ретінде қолданылуы керек және
                әрқашан білікті маманның бақылауында болуы тиіс.\n
                \n
                Бес жүйелі шолудың, екі мета-талдаудың, үш жүйелі шолу-мета-талдаудың нәтижелері талданды.
                Бүгінде АСБ бар балаларды диагностикалау және емдеу үшін ЖИ қолданудың бірыңғай тәсілдері
                жоқ. Қолданыстағы машиналық оқыту алгоритмдері бақыланатын, жартылай бақыланатын,
                бақыланбайтын болып бөлінеді. Жұмыстардың көпшілігі тірек векторлық машинаның өнімділігін
                бағалауды, нейрондық желілерді және шешім ағаштарын қамтиды, олардың ішінде нейрондық
                желіні талдау ең жоғары тиімділікті көрсетті.\n
                \n
                ЖИ аутизм спектрінің бұзылуының диагностикасы мен емдеу үшін әртүрлі тәсілдермен
                қолданылады. Жүргізілген талдау болашақ даму мен өнімділікте үлкен әлеуетке ие АСБ
                диагностикасы мен емдеуге арналған ЖИ зерттеулерінің өсуін көрсетті.\n
                \n
                2 Распространенность и диагностика неврологических расстройств с использованием различных методов глубокого обучения: метаанализ\n
                \n
                В статье представлен обзор методов глубокого обучения, используемых для прогнозирования
                восьми различных психоневрологических и неврологических расстройств, таких как инсульт,
                болезнь Альцгеймера, паркинсона, эпилепсия, аутизм, мигрень, церебральный паралич и
                рассеянный склероз. Эти заболевания являются критическими, опасными для жизни и в
                большинстве случаев могут привести к другим опасным заболеваниям человека. Методы
                глубокого обучения — это новая технология мягких вычислений, которая успешно используется
                для решения различных реальных задач, таких как распознавание образов (лиц, эмоций и речи),
                управление трафиком, поиск лекарств, диагностика заболеваний и обнаружение сетевых
                вторжений. Это исследование описывает дисциплину, рамки и методологии, используемые
                различными методами глубокого обучения для диагностики различных неврологических
                расстройств человека. Здесь изучаются сто тридцать шесть различных статей, связанных с
                неврологическими и нейропсихиатрическими расстройствами, диагностируемыми с
                использованием различных методов глубокого обучения. Также были описаны заболеваемость и
                смертность от основных нейропсихиатрических и неврологических расстройств. Были изучены и
                проанализированы результаты и тенденции публикации различных методов глубокого обучения,
                используемых при исследовании этих заболеваний. Также были изучены различные показатели
                эффективности, такие как точность, специфичность и чувствительность. Также были освещены
                результаты исследования, проблемы и направления на будущее, связанные с исследованием. В
                конечном итоге были выявлены нарушения в исследованиях, и стало очевидным, что диагностика
                мигрени, церебрального паралича и инсульта имеет больше возможностей при использовании
                различных моделей глубокого обучения.\n
                \n
                Терең оқытудың әртүрлі әдістерін қолдана отырып, неврологиялық бұзылулардың таралуы және
                диагностикасы: мета-талдау\n
                \n
                Мақалада инсульт, Альцгеймер ауруы, паркинсон, эпилепсия, аутизм, мигрень, церебральды сал
                ауруы және склероз сияқты сегіз түрлі психоневрологиялық және неврологиялық бұзылуларды
                болжау үшін қолданылатын терең оқыту әдістеріне шолу жасалған.\n
                \n
                Бұл аурулар өмірге қауіп төндіреді және көп жағдайда адамның басқа қауіпті ауруларға
                шалдығуын әкелуі мүмкін. Терең оқыту әдістері - бұл образдарды тану (бет, эмоция және сөйлеу),
                трафикті басқару, дәрі-дәрмектерді іздеу, ауруларды диагностикалау және желілік интрузияларды
                анықтау сияқты әртүрлі нақты мәселелерді шешу үшін сәтті қолданылатын жаңа жұмсақ есептеу
                технологиясы. Бұл зерттеу адамның әртүрлі неврологиялық бұзылыстарын диагностикалау үшін
                әртүрлі терең оқыту әдістері қолданатын дисциплина мен әдістемелерді сипаттайды. Мұнда терең
                оқытудың әртүрлі әдістерін қолдану арқылы диагноз қойылған неврологиялық және
                нейропсихиатриялық бұзылуларға қатысты 136 түрлі мақала қарастырылады. Негізгі
                нейропсихиатриялық және неврологиялық бұзылулардан болатын ауру мен өлім-жітім де
                сипатталған. Осы ауруларды зерттеуде қолданылатын әртүрлі терең оқыту әдістерін жариялау
                нәтижелері мен тенденциялары зерттелді және талданды. Дәлдік, ерекшелік және сезімталдық
                сияқты әртүрлі тиімділік көрсеткіштері де зерттелді. Зерттеу нәтижелері, проблемалар және
                зерттеуге байланысты болашақ бағыттар да қамтылды. Нәтижесінде зерттеулерде бұзылулар
                анықталды және мигрень, церебральды сал ауруы, сондай-ақ инсульт диагностикасының әртүрлі
                терең оқыту үлгілерін пайдалануда көбірек мүмкіндіктері бар екені белгілі болды.\n
                \n
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "ВАК 2 Семей done",
                slug: `вак_2_семей_done`,
                description: `ПСИХОЛОГИЧЕСКАЯ ПОДДЕРЖКА РОДИТЕЛЕЙ, ВОСПИТЫВАЮЩИХ ДЕТЕЙ С РАССТРОЙСТВАМИ
                АУТИСТИЧЕСКОГО СПЕКТРА\n
                \n
                Родители, ухаживающие за детьми с расстройством аутистического спектра (РАС), часто сообщают
                о повышенном уровне стресса, депрессии и тревоги. Неудовлетворенные потребности родителей,
                осуществляющих уход, в области психического здоровья представляют значительный риск для
                психологического, физического и социального благополучия родителей ребенка, страдающего
                РАС.\n
                \n
                В этой статье представлены результаты вмешательств, которые поддерживают психическое
                здоровье родителей, осуществляющих уход, и предлагаются рекомендации по поддержке
                практикующих родителей, осуществляющих уход.\n
                \n
                Были проанализированы результаты трех систематических обзоров и мета-анализов, а также семи
                рандомизированных клинических исследований (РКИ). В настоящее время не существует единых
                подходов к применению программ для родителей детей с РАС, способствующих поддержанию
                психологического здоровья и развитию навыков совладания с чувствами напряженности и
                стресса.\n
                \n
                Результаты показывают, что интегрированная образовательная программа для родителей,
                разработанная для лиц, осуществляющих уход за детьми с РАС, может оказать положительное
                влияние на качество жизни лиц, осуществляющих уход, связанное с психическим здоровьем.\n
                \n
                Полученные результаты указывают на то, что рекомендации врачей должны включать
                рассмотрение родителями их собственной точки зрения и навыков решения проблем в режиме
                постоянного живого контакта с другими подобными заботливыми родителями и повышать их
                общую способность решать проблемы, восприятие их собственная точка зрения и чувство
                значимости в качестве опекунов.\n
                \n
                АУТИЗМ СПЕКТРІ БҰЗЫЛҒАН БАЛАЛАРДЫ ТӘРБИЕЛЕП ОТЫРҒАН АТА-АНАЛАРҒА ПСИХОЛОГИЯЛЫҚ ҚОЛДАУ\n
                \n
                Аутизм спектрі бұзылған (АСБ) балаларға күтім жасайтын ата-аналар көбінесе стресс, депрессия
                және мазасыздық деңгейінің жоғарылағанын хабарлайды. Ата-аналардың психикалық
                денсаулығының қанағаттандырылмаған қажеттіліктері АСБ-мен ауыратын баланың ата-анасының
                психологиялық, физикалық және әлеуметтік әл-ауқатына айтарлықтай қауіп төндіреді.\n
                \n
                Бұл мақалада қамқоршы ата-аналардың психикалық денсаулығын қолдайтын араласулардың
                нәтижелері келтірілген және қамқоршы ата-аналарға қолдау көрсету бойынша ұсыныстар
                берілген.\n
                \n
                Үш жүйелі шолу мен мета-анализдің нәтижелері, сондай-ақ жеті рандомизерленген клиникалық
                зерттеулер (РКЗ) талданды. Бүгінде АСБ бар балалардың ата-аналарына психологиялық
                денсаулықты сақтауға және шиеленіс пен стресс сезімдерімен күресу дағдыларын дамытуға
                ықпал ететін бағдарламаларды қолданудың бірыңғай тәсілдері жоқ.\n
                \n
                Нәтижелер АСБ бар балаларға күтім жасайтын ата-аналарға арналған интеграцияланған білім беру
                бағдарламасы психикалық денсаулықпен байланысты күтім көрсетушілердің өмір сапасына оң
                әсер етуі мүмкін екенін көрсетеді.\n
                \n
                Алынған нәтижелер дәрігерлердің ұсыныстары ата-аналардың өз көзқарастары мен
                проблемаларды шешу дағдыларын басқа ұқсас қамқор ата-аналармен үнемі тікелей байланыс режимінде қарастыруды және олардың проблемаларды шешу қабілеттерін, қабылдауын
                арттыруды қамтуы керек екенін көрсетеді.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "BAK 5 Clinical medicine done",
                slug: `вак_5_clinical_medicine_done`,
                description: `Восприятие расстройств аутистического спектра среди населения Казахстана.\n
                \n
                Рост числа людей с расстройствами аутистического спектра по всему миру требует понимания
                симптомов, раннего выявления и комплексного ухода. Повышение здравоохранительной
                грамотности населения способствует более легкому восприятию и пониманию семей, имеющих
                детей с РАС. Цель исследования - понять позицию населения Казахстана относительно
                расстройств аутистического спектра. Для этого был проведен опрос с использованием онлайн-
                платформы Google среди населения всех регионов страны в первой половине 2023 года. В опросе
                приняли участие 410 респондентов, а анализ проводился с использованием программного
                обеспечения SPSS13. Кроме того, в ответах населения на ситуации с детьми с РАС на улице были
                отмечены страх и любопытство, а также выявлены пробелы в знаниях или методах помощи этим
                детям.\n
                \n
                Қазақстанның тұрғындары арасында аутизм спектрінің бұзылуын қабылдау.\n
                \n
                Аутизм спектрі бұзылуы бар адамдар санының әлем бойынша өсуі симптомдарды түсінуді, ерте
                анықтауды және кешенді күтімді қажет етеді. Халықтың денсаулық сақтау сауаттылығын арттыру
                АСБ бар балалары бар отбасыларды оңай қабылдауға және түсінуге ықпал етеді. Зерттеудің
                мақсаты - аутизм спектрінің бұзылуына қатысты Қазақстан халқының ұстанымын түсіну. Ол үшін
                2023 жылдың бірінші жартыжылдығында еліміздің барлық өңірлерінің тұрғындары арасында
                Google онлайн-платформасын пайдалана отырып сауалнама жүргізілді. Сауалнамаға 410
                респондент қатысты, ал талдау SPSS13 бағдарламалық жасақтамасын қолдану арқылы жүргізілді.
                Сонымен қатар халықтың АСБ бар балалармен көшеде орын алғаг жағдайларға қатысты берген
                жауаптарында қорқыныш пен қызығушылық байқалды, сондай-ақ бұл балаларға көмектесу үшін
                білім немесе әдістердегі олқылықтар анықталды.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "2024 BAK 6 Мадина КазНУ done",
                slug: `2024_вак_6_медицина_казну_done`,
                description: `ПМПК исследование:\n
                \n
                В Казахстане было проведено исследование о роли и методах работы психолого-медико-
                педагогических консультаций (ПМПК) с детьми, страдающими расстройствами аутического
                спектра (РАС), в рамках целей устойчивого развития ООН.\n
                \n
                Для этого была использована анкета с 16 вопросами, опрос приняли 346 респондентов из 8
                регионов Казахстана с помощью Google Forms, а данные анализировались с использованием SPSS,
                что позволило выявить 6 ключевых категорий в работе с детьми с РАС.\n
                \n
                Результаты показали, что большинство участников опроса отмечают рост детей с РАС и выявили
                нехватку знаний и навыков у специалистов ПМПК, осуществляющих диагностику и оценку детей с
                РАС.\n
                \n
                Проведение дополнительного обучения и подготовка персонала ПМПК являются важными
                шагами для улучшения качества обслуживания детей с РАС и развития инклюзивной
                образовательной среды.\n
                \n
                ПМПК зерттеу:\n
                \n
                Қазақстанда БҰҰ-ның тұрақты даму мақсаттары шеңберінде аутизм спектрінің бұзылуы (АСБ) бар
                балалармен психологиялық-медициналық-педагогикалық консультациялардың (ПМПК) рөлі мен
                жұмыс әдістері туралы зерттеу жүргізілді.\n
                \n
                Ол үшін 16 сұрақтан тұратын сауалнама пайдаланылды, сауалнаманы Google Forms көмегімен
                Қазақстанның 8 өңірінен 346 респондент қабылдады, ал деректер SPSS көмегімен талданды, бұл
                АСБ бар балалармен жұмыс істеуде 6 негізгі санатты анықтауға мүмкіндік берді.\n
                \n
                Сауалнама қатысушыларының көпшілігі АСБ бар балалар санының өсуін және АСБ бар балаларды
                диагностикалау мен бағалауды жүзеге асыратын ПМПК мамандарының білімі мен дағдыларының
                жетіспеушілігін анықтағанын көрсетті.\n
                \n
                ПМПК қызметкерлерін қосымша оқыту және даярлау АСБ бар балаларға қызмет көрсету сапасын
                жақсарту және инклюзивті білім беру ортасын дамыту үшін маңызды қадамдар болып табылады.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "BAK 4 Абай done",
                slug: `вак_4_абай_done`,
                description: `Ситуационный анализ межсекторального ухода за детьми с расстройством аутистического
                спектра.\n
                \n
                В данной статье представлен ситуационный анализ межсекторальной заботы о детях с
                расстройством аутистического спектра (РАС) в Казахстане. В ходе исследования были рассмотрены
                правовые документы в сферах здравоохранения, образования и социального обслуживания за
                период с 2017 по 2023 год. Основное внимание уделено недавним изменениям в обеспечении
                комплексной помощи детям с РАС, анализу подходов, проблемам в реализации этих нормативов
                и оценке потенциальных выгод для пациентов. Результаты обсуждались проектной группой,
                включающей родителей детей с РАС и специалистов из сферы инклюзивных услуг. Проделанная
                работа показала, что недавние изменения в законодательстве перешли от медицинской к социо-
                педагогической модели, сосредотачиваясь на создании условий для развития детей с особыми
                образовательными потребностями. А также были выявлены проблемы в недостатке
                стандартизированных подходов среди медицинских специалистов и недостатке психологической
                поддержки для родителей, и были предложены возможности для улучшения системы через
                дальнейшее обучение и руководство для профессионалов в сфере здравоохранения, образования
                и социального обслуживания.\n
                \n
                Аутизм спектрі бұзылған балалардың сектораралық күтімін ситуациялық талдау.\n
                \n
                Бұл мақалада Қазақстанда аутизм спектрі бұзылған (АСБ) балаларға сектораралық қамқорлықтың
                ситуациялық талдауы ұсынылған. Зерттеу барысында 2017-2023 жылдар аралығындағы
                Денсаулық сақтау, білім беру және әлеуметтік қызмет көрсету салаларындағы құқықтық құжаттар
                қаралды. АСБ бар балаларға кешенді көмек көрсетудегі соңғы өзгерістерге, тәсілдерді талдауға,
                осы стандарттарды жүзеге асырудағы қиындықтарға және пациенттер үшін ықтимал пайданы
                бағалауға назар аударылады. Нәтижелерді АСБ бар балалардың ата-аналары мен инклюзивті
                қызмет көрсету саласындағы мамандардан құралған жобалық топ талқылады. Атқарылған жұмыс
                заңнамадағы соңғы өзгерістер ерекше білім беру қажеттіліктері бар балалардың дамуы үшін
                жағдай жасауға назар аудара отырып, медицинадан әлеуметтік-педагогикалық модельге
                ауысқанын көрсетті. Сондай-ақ медицина мамандары арасында стандартталған тәсілдердің
                аздығы және ата-аналарға психологиялық қолдаудың жетіспеушілігі проблемалары анықталды,
                бұдан бөлек денсаулық сақтау, білім беру және әлеуметтік қызмет көрсету саласындағы
                мамандарды одан әрі оқыту арқылы жүйені жақсарту мүмкіндіктері ұсынылды.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "2024 ВАК 7 РЦРЗ Лаура done",
                slug: `2024_вак_7_рцрз_лаура_done`,
                description: `Анализ эффективности программы повышения квалификации «Реабилитация детей с
                расстройствами аутистического спектра»\n
                \n
                Рост числа детей с расстройствами аутистического спектра по всему миру требует пересмотра
                помощи, которая оказывается им в различных сферах. Врачи, занимающиеся уходом за людьми с
                аутизмом, ограничены в своих возможностях, поэтому требуются специализированные
                образовательные программы. Целью исследования является анализ эффективности программы
                «Реабилитация детей с расстройствами аутистического спектра» для специалистов первичного
                звена здравоохранения. Методы включают создание команды, разработку программы обучения и
                сбор обратной связи от участников. Полученные результаты свидетельствуют о высоком качестве
                программы и необходимости ее дальнейшего усовершенствования. В предстоящих планах –
                продолжение обучающих семинаров и разработка онлайн-курсов для специалистов в отдаленных
                регионах.\n
                \n
                Аутизм спектрі бұзылған балаларды оңалту» біліктілікті арттыру бағдарламасының тиімділігін талдау\n
                \n
                Дүние жүзінде аутизм спектрі бұзылған балалар санының өсуі оларға әртүрлі салаларда
                көрсетілетін көмекті қайта қарауды талап етеді. Аутизммен ауыратын адамдарға күтім жасайтын
                дәрігерлер мүмкіндіктерде шектеулі, сондықтан арнайы білім беру бағдарламалары қажет.
                Зерттеудің мақсаты: денсаулық сақтау саласының мамандары үшін «Аутизм спектрі бұзылған
                балаларды оңалту» бағдарламасының тиімділігін талдау болып табылады. Әдістерге команда
                құру, оқу бағдарламасын әзірлеу және қатысушылардан кері байланыс жинау кіреді. Алынған
                нәтижелер бағдарламаның жоғары сапасын және оны одан әрі жетілдіру қажеттілігін көрсетеді.
                Алдағы жоспарларда - оқыту семинарларын жалғастыру және шалғай өңірлердегі мамандар үшін
                онлайн-курстар әзірлеу бар.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
            {
                title: "ВАК 8 Гумилев done",
                slug: `вак_8_гумилев_done`,
                description: `Вопросы готовности педагогов к сопровождению обучающегося с расстройством аутистического
                спектра в школах Казахстана\n
                \n
                Исследование в рамках проекта, поддержанного университетом SDU, выявило недостаточную
                готовность педагогов в Казахстане к работе с детьми, страдающими расстройством аутистического
                спектра (РАС). Проведенный опрос и интервью подтвердили необходимость систематизации
                обучающих курсов по инклюзивному образованию, особенно в области психологической и
                педагогической поддержки детей с РАС. Важной задачей является сближение усилий
                педагогического коллектива для глубокого понимания индивидуальных особенностей развития и
                обучения каждого ребенка и выбора соответствующих инструментов работы с ним. Улучшение
                образовательного процесса включает в себя изменение методик преподавания на основе
                принципов дифференциации и персонализации, а также активизацию деятельности учащихся во
                время занятий. Также необходимо исследовать вопрос о реструктуризации форм методической
                поддержки для учителей по вопросам инклюзивного образования в соответствии с
                современными реалиями и возможностями.\n
                \n
                Қазақстан мектептерінде аутизм спектрі бұзылған оқушыға көмек көрсетуге педагогтердің
                дайындығы жөніндегі мәселелер\n
                \n
                SDU университеті қолдаған жоба аясындағы зерттеу Қазақстандағы педагогтардың аутизм
                спектрінің бұзылуынан (АСБ) зардап шегетін балалармен жұмыс істеу дайындығын анықтады.
                Жүргізілген сауалнама мен сұхбат инклюзивті білім беру бойынша оқыту курстарын, әсіресе АСБ
                бар балаларды психологиялық және педагогикалық қолдау саласында жүйелеу қажеттілігін
                растады. Әрбір баланың дамуы мен оқуының жеке ерекшеліктерін терең түсіну және онымен
                жұмыс істеудің тиісті құралдарын таңдау үшін педагогикалық ұжымның күш-жігерін
                жақындастыру маңызды міндет болып табылады. Білім беру процесін жақсарту саралау және
                жекелендіру принциптері негізінде оқыту әдістемесін өзгертуді, сондай-ақ сабақ барысында
                оқушылардың белсенділігін арттыруды қамтиды. Бұдан бөлек, заманауи мүмкіндіктерге сәйкес
                инклюзивті білім беру мәселелері бойынша мұғалімдерге әдістемелік қолдау нысандарын қайта
                құрылымдау туралы мәселені зерттеу қажет.
                `,
                looked: 0,
                createdAt: specificDate,
                updatedAt: specificDate,
            },
        ]);
    },

    async down(queryInterface, Sequelize) {
        return queryInterface.bulkDelete('news', null, {});
    }
};